/*
Задача: "Запізнілий студент і сходи"  

Умова:  
Студент Вася проспав і запізнюється на важливу пару, 
що проходить на *n*-му поверсі. Ліфт не працює, 
і він може підніматися лише на 1 або 2 поверхи за раз.  

Напишіть програму, яка визначає, скількома способами 
Вася може дістатися до n-го поверху, якщо починає з 0-го.  

Вхідні дані:  
Одне ціле число n — номер поверху, де знаходиться аудиторія

Вихідні дані:  
Виведіть кількість можливих способів піднятися на n -й поверх.  

*/

#include "exercise1_hard.h"

long long countWays(int n) {

}



/*
ДЛЯ ПЕРЕВІРКИ: 
g++ -Wall -O2 -std=c++11 -I./exercises -I./tests ./tests/test_exercise1_hard.cpp ./exercises/exercise1_hard.cpp -o test_exercise1_hard && ./test_exercise1_hard
*/