/* 
Задача: "Запізнілий студент та натовп у коридорі"  

Умова:
Студент Вася запізнюється на пару та біжить вузьким університетським коридором. 
У коридорі також рухаються інші студенти. Кожен студент має свою вагу (абсолютне значення числа) 
і напрямок руху (позитивне число — вперед, негативне — назад).  

Всі студенти рухаються з однаковою швидкістю. Якщо двоє студентів зустрічаються:  
- Той, у кого менша вага, поступається і вибуває.  
- Якщо обидва мають однакову вагу, вони обоє зупиняються та вибувають.  
- Якщо студенти рухаються в одному напрямку, вони ніколи не зіткнуться.  

Знайдіть, хто залишиться в коридорі після всіх можливих зіткнень.  


Приклад роботи програми
Вхід:  

студенти = [5,10,-5]  

Вихід:

[5,10] 
 */

#include "exercise2_hard.h"



std::vector<int> resolveStudents(const std::vector<int>& students) {
    
}


/*
ДЛЯ ПЕРЕВІРКИ: 
g++ -Wall -O2 -std=c++11 -I./exercises -I./tests ./tests/test_exercise2_hard.cpp ./exercises/exercise2_hard.cpp -o test_exercise2_hard && ./test_exercise2_hard
*/
