// Дівчина Оля полюбляє гарно одягатися. Коли вона вдягає підбори з капелюхом, то її зріст становить a см. 
// Коли вона надягає тільки капелюх, то стає ростом b см, 
// а коли тільки підбори - c см. Який насправді зріст у Олі?
// ВВІД: Ввести три числа a, b та c, які будуть означати зріст Олі в капелюсі та підборах,
//  зріст Олі тільки в капелюсі та зріст Олі тільки на підборах відповідно. 
// ВИВІД: Єдине число, яке означатиме дійсний зріст Олі

#include "exercise2_easy.h"
#include <stdexcept>

int getActualHeight(int a, int b, int c) {
    
}

/*
ДЛЯ ПЕРЕВІРКИ: 
g++ -Wall -O2 -std=c++11 -I./exercises -I./tests ./tests/test_exercise2_easy.cpp ./exercises/exercise2_easy.cpp -o test_exercise2_easy && ./test_exercise2_easy
*/