// Уявіть, що перед вами - шахова дошка розміром n на n клітинок,
//  і ці клітинки пронумеровані натуральними числами від 1 до n^2 зліва направо по порядку так,
//  що в кожній білій клітинці міститься непарне число, а в чорних - відповідно всі парні.
//  Порахуйте, яка сума чисел, записаних в білих клітинках
// ВВІД: Введіть одне натуральне парне число n - розмір шахової дошки. 
// (Плюсом буде якщо учасник зробить обмеження для n)
// ВИВІД: Виведіть суму чисел на білих клітинках


#include "exercise5_easy.h"

int sumWhiteCells(int n) {

}


/*
ДЛЯ ПЕРЕВІРКИ: 
g++ -Wall -O2 -std=c++11 -I./exercises -I./tests ./tests/test_exercise5_easy.cpp ./exercises/exercise5_easy.cpp -o test_exercise5_easy && ./test_exercise5_easy
*/