// Уявіть, що ви хочете надрукувати на принтері піраміду з будь-якого символу і висотою h. 
// Напишіть для цього код, але такий, щоб 
// ця піраміда друкувалася з найменшою кількістю символів, щоб чорнила в принтері не переводилися.
// ВВІД: В першому рядку вводиться символ, з якого буде друкуватися піраміда, 
// в другому - число h, що задаватиме висоту піраміди 
// (Плюсом буде якщо учасник зробить для висоти якесь обмеження, щоб піраміда не могла бути занадто великою)
// ВИВІД: В першому рядку виведіть загальну кількість 
// "надрукованих символів" числом, в другому - саму символьну піраміду.
// (Вирішується по формулі суми перших непарних чисел і реалізується за допомогою простого циклу)


#include "exercise4_easy.h"

std::string print_pyramid(char symbol, int h) {

}


/*
ДЛЯ ПЕРЕВІРКИ: 
g++ -Wall -O2 -std=c++11 -I./exercises -I./tests ./tests/test_exercise4_easy.cpp ./exercises/exercise4_easy.cpp -o test_exercise4_easy && ./test_exercise4_easy
*/