// Шифр "Залізнична огорожа"

// Реалізуйте дві функції для кодування та декодування рядка за допомогою шифру "Залізнична огорожа".
//  Цей шифр працює так: кожен символ розміщується по діагоналі вниз уздовж набору "рейок". Коли ви досягаєте нижнього ряду,
// напрям змінюється, і рух триває по діагоналі вгору, доки не досягнете верхньої рейки. Процес повторюється до кінця рядка. 
// Закодований рядок отримується шляхом читання кожного ряду зліва направо.

// Наприклад, рядок "МАМАКУПІМНЕСНЕЖІНКУ" можна представити у системі з трьома рейками так:
// М       К       М       Н       Н
//   А   А   У   І   Н   С   E   І   К
//      М       П        Е       Ж      У
// Закодований рядок:
// МКМННААУІНСЕІКМПЕЖУ
// Завдання:
// •	Напишіть функцію, яка приймає два аргументи: рядок і кількість рейок. Вона повинна повертати закодований рядок.
// •	Напишіть другу функцію, яка приймає два аргументи: закодований рядок і кількість рейок. Вона повинна повертати розшифрований рядок.
// Додаткові умови:
// •	Кількість рейок завжди буде не меншою за 2.
// •	Якщо переданий порожній рядок, функція має повернути порожній рядок.
// •	Не видаляйте розділові знаки та пробіли – вони є частиною рядка.

#include "exercise2_hard.h"
#include <vector>
#include <iostream>

std::string railFenceEncode(const std::string& text, int rails) {
    
}

std::string railFenceDecode(const std::string& encodedText, int rails) {
    
}


/*
ДЛЯ ПЕРЕВІРКИ: 
g++ -Wall -O2 -std=c++11 -I./exercises -I./tests ./tests/test_exercise2_hard.cpp ./exercises/exercise2_hard.cpp -o test_exercise2_hard && ./test_exercise2_hard
*/